<a href="https://colab.research.google.com/github/moyixinqing/CSE6040x/blob/master/JSON_and_Pandas.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
from google.colab import drive
drive.mount('/content/drive')

Mounted at /content/drive

In [ ]:
import pandas as pd
file_name = "/content/drive/My Drive/MOCK_DATA.json"

df = pd.read_json(file_name)
df.head()

   id  ...                                            friends
0   1  ...  [{'first_name': 'Miran', 'last_name': 'De'Vere...
1   2  ...  [{'first_name': 'Dian', 'last_name': 'Hounsham...
2   3  ...  [{'first_name': 'Meghann', 'last_name': 'Vanna...
3   4  ...                                                 []
4   5  ...  [{'first_name': 'Andrus', 'last_name': 'Szymon...

[5 rows x 6 columns]

Splitting dictionary/list inside a Pandas Column into Separate Columns


There is a nice way of using `.apply` and `pd.Series` to accomplish this task: [Stack Overflow](https://stackoverflow.com/questions/38231591/splitting-dictionary-list-inside-a-pandas-column-into-separate-columns) is your friend!

In [ ]:
df.email.apply(pd.Series)

                          personal                      working
0        nricciardo0@hostgator.com         nricciardo0@java.com
1             mlittlewood1@icio.us       mlittlewood1@vimeo.com
2               rcasswell2@soup.io         rcasswell2@apple.com
3                lbugbee3@dmoz.org    lbugbee3@odnoklassniki.ru
4     ndenormanville4@illinois.edu     ndenormanville4@tamu.edu
..                             ...                          ...
995              dzarfairn@163.com    dzarfairn@telegraph.co.uk
996              bjulianro@psu.edu           bjulianro@sohu.com
997            emoriganrp@ehow.com   emoriganrp@arstechnica.com
998  jkinsellarq@blogtalkradio.com  jkinsellarq@bizjournals.com
999               bbretonrr@pen.io       bbretonrr@linkedin.com

[1000 rows x 2 columns]

In [ ]:
df.join(df.email.apply(pd.Series)).drop('email', axis=1)

       id  ...                      working
0       1  ...         nricciardo0@java.com
1       2  ...       mlittlewood1@vimeo.com
2       3  ...         rcasswell2@apple.com
3       4  ...    lbugbee3@odnoklassniki.ru
4       5  ...     ndenormanville4@tamu.edu
..    ...  ...                          ...
995   996  ...    dzarfairn@telegraph.co.uk
996   997  ...           bjulianro@sohu.com
997   998  ...   emoriganrp@arstechnica.com
998   999  ...  jkinsellarq@bizjournals.com
999  1000  ...       bbretonrr@linkedin.com

[1000 rows x 7 columns]

In [ ]:
Loop through json

In [ ]:
import json

json_file = open((file_name), encoding="utf8")
json_str = json_file.read()
json_data = json.loads(json_str)

In [ ]:
[l['id'] for l in json_data if '.edu' in l['email']['personal']]

[5,
 58,
 69,
 85,
 92,
 102,
 129,
 165,
 203,
 207,
 279,
 285,
 295,
 296,
 305,
 337,
 358,
 383,
 385,
 458,
 473,
 509,
 520,
 537,
 551,
 598,
 628,
 668,
 694,
 701,
 719,
 724,
 763,
 795,
 802,
 805,
 826,
 830,
 839,
 868,
 884,
 885,
 890,
 898,
 899,
 906,
 907,
 910,
 928,
 945,
 951,
 986,
 997]